cases/1.gravity-capillarity/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  foam-extend 5.0
    \\  /    A nd           | PorousMedia: A Wikki Brasil project
     \\/     M anipulation  | Solver: coupledMatrixFoam
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

x                             0.1;
y                             1.0;
z                             0.1;
nx                            1;
ny                            1500;
nz                            1;
vertices                      
(
    (0 0 0)
    ($x 0 0)
    ($x $y 0)
    (0 $y 0)
    (0 0 $z)
    ($x 0 $z)
    ($x $y $z)
    (0 $y $z)
);
blocks                        
(
    hex (0 1 2 3 4 5 6 7) ($nx $ny $nz) simpleGrading (1 1 1)
);
edges                         ( );
boundary                      
(
    bottom
    {
        type                          patch;
        faces                         
        (
            (0 4 5 1)
        );
    }
    top
    {
        type                          patch;
        faces                         
        (
            (7 3 2 6)
        );
    }
    walls
    {
        type                          walls;
        faces                         
        (
            (0 4 7 3)
            (1 2 6 5)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);
mergePatchPairs               ( );


//************************************************************************** //
