cases/1.gravity-capillarity/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    bottom
    {
        type            patch;
        nFaces          1;
        startFace       1499;
    }
    top
    {
        type            patch;
        nFaces          1;
        startFace       1500;
    }
    walls
    {
        type            walls;
        nFaces          6000;
        startFace       1501;
        faces           ( ( 0 4 7 3 ) ( 1 2 6 5 ) ( 0 3 2 1 ) ( 4 5 6 7 ) );
    }
)


// ************************************************************************* //
